<script module>
  export let structured_members = $state([
    {
      name: '二期生',
      members: [
        '井上 梨名',
        '遠藤 光莉',
        '大園 玲',
        '大沼 晶保',
        '幸阪 茉里乃',
        '武元 唯衣',
        '田村 保乃',
        '藤吉 夏鈴',
        '増本 綺良',
        '松田 里奈',
        '森田 ひかる',
        '守屋 麗奈',
        '山﨑 天'
      ],
      enabled: true
    },
    {
      name: '三期生',
      members: [
        '石森 璃花',
        '遠藤 理子',
        '小田倉 麗奈',
        '小島 凪紗',
        '谷口 愛季',
        '中嶋 優月',
        '的野 美青',
        '向井 純葉',
        '村井 優',
        '村山 美羽',
        '山下 瞳月'
      ],
      enabled: true
    },
    {
      name: '四期生',
      members: [
        '浅井 恋乃未',
        '稲熊 ひな',
        '勝又 春',
        '佐藤 愛桜',
        '中川 智尋',
        '松本 和子',
        '目黒 陽色',
        '山川 宇衣',
        '山田 桃実'
      ],
      enabled: true
    }
  ]);
  export const cuts = ['ヨリ', 'チュウ', 'ヒキ', '座り'];
</script>
